In [136]:
pip install pandas

Requirement already satisfied: pandas in c:\users\pratyush mishra\anaconda3\lib\site-packages (2.2.2)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: numpy>=1.26.0 in c:\users\pratyush mishra\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\pratyush mishra\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\pratyush mishra\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\pratyush mishra\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\pratyush mishra\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [137]:
import pandas as pd

In [138]:
data = {
    'a':[1,2,3,4],
    'b':[4,5,6,7],
    'c':[7,8,5,2],
    'd':['Pratyush','BOB','Dean','Rhea']
}
df = pd.DataFrame(data)
df

   a  b  c         d
0  1  4  7  Pratyush
1  2  5  8       BOB
2  3  6  5      Dean
3  4  7  2      Rhea

In [139]:
df.set_index('a')

   b  c         d
a
1  4  7  Pratyush
2  5  8       BOB
3  6  5      Dean
4  7  2      Rhea

In [140]:
df.set_index("d",inplace= True)
df

          a  b  c
d
Pratyush  1  4  7
BOB       2  5  8
Dean      3  6  5
Rhea      4  7  2

In [141]:
df = df.reset_index()
df

          d  a  b  c
0  Pratyush  1  4  7
1       BOB  2  5  8
2      Dean  3  6  5
3      Rhea  4  7  2

In [142]:
data = {
    'a':[1,2,3,4],
    'b':[4,5,6,7],
    'c':[7,8,5,2],
    'd':['Pratyush','BOB','Dean','Rhea']
}
df1 = pd.DataFrame(data,index=['a','b','c','d'])
df1

   a  b  c         d
a  1  4  7  Pratyush
b  2  5  8       BOB
c  3  6  5      Dean
d  4  7  2      Rhea

In [143]:
df1 = df1.reindex(['b','c','d','a'])
df1

   a  b  c         d
b  2  5  8       BOB
c  3  6  5      Dean
d  4  7  2      Rhea
a  1  4  7  Pratyush

In [144]:
for i in df1.iterrows():
    print(i)

('b', a      2
b      5
c      8
d    BOB
Name: b, dtype: object)
('c', a       3
b       6
c       5
d    Dean
Name: c, dtype: object)
('d', a       4
b       7
c       2
d    Rhea
Name: d, dtype: object)
('a', a           1
b           4
c           7
d    Pratyush
Name: a, dtype: object)

In [ ]:
df1.reset_index()

In [146]:
for i in df1.iterrows():
    print(i)

('b', a      2
b      5
c      8
d    BOB
Name: b, dtype: object)
('c', a       3
b       6
c       5
d    Dean
Name: c, dtype: object)
('d', a       4
b       7
c       2
d    Rhea
Name: d, dtype: object)
('a', a           1
b           4
c           7
d    Pratyush
Name: a, dtype: object)

In [150]:
list(df['d'])

['Pratyush', 'BOB', 'Dean', 'Rhea']

In [154]:
def text(x):
    return x.sum()
df1.apply(text)

a                     10
b                     22
c                     22
d    BOBDeanRheaPratyush
dtype: object